In [1]:
import warnings
%run ConnectOracleDB.ipynb

C:\Users\a.tsereteli\AppData\Local\Temp\ipykernel_18016\3979122280.py:20: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql(sql_query,connection)  # without parameters [non-prepared statement]

In [2]:
table_name = 'DWH_COE.DICT_OFFER'
df = fetch_table_as_dataframe(table_name)

C:\Users\a.tsereteli\AppData\Local\Temp\ipykernel_18016\3979122280.py:20: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql(sql_query,connection)  # without parameters [non-prepared statement]

In [3]:
# Data analysis and wrangling
import pandas as pd
import numpy as np

# Data visualisation
import seaborn as sns
import matplotlib.pyplot as plt

# Shows plots in jupyter notebook
%matplotlib inline

# Set plot style
sns.set(color_codes=True)

# Remove warnings
import warnings
warnings.filterwarnings('ignore')

In [4]:
df.head(5)

,OFFER_ID,OFFER_TYPE,OFFER_NAME,OFFER_CATEGORY,REC_DATE,SAS_MAPPING
0,40001.0,11,Happy Card,None,NaT,OTHER
1,40003.0,13,One-time Data Package 3GB for 15 USD,None,NaT,Data Package
2,40005.0,12,SMS Package 200 item for 10 USD,None,NaT,SMS Data
3,40006.0,12,Data Package 2GB for 20 USD,None,NaT,Data Package
4,40008.0,12,Unlimited Roaming Package 4days for Japan,Roaming,NaT,None

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4782 entries, 0 to 4781
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   OFFER_ID        4782 non-null   float64
 1   OFFER_TYPE      4782 non-null   object
 2   OFFER_NAME      4782 non-null   object
 3   OFFER_CATEGORY  154 non-null    object
 4   REC_DATE        1088 non-null   datetime64[ns]
 5   SAS_MAPPING     3434 non-null   object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 224.3+ KB

In [12]:
offers =df["OFFER_NAME"].unique()

In [13]:
len(offers)

4772